import { disassemble } from '../src'

describe('disassemble()', () => {
  it('should be sane', () => {
    const input =
      '擬要也, 마 그리 호려 다, 又欲也, 待賣幾箇馬去 여러  오져 야 가노라'
    const output = [
      '擬',
      '要',
      '也',
      ',',
      ' ',
      ['ᄒ', 'ᆞ'],
      ['ㅁ', 'ㅏ'],
      ' ',
      ['ㄱ', 'ㅡ'],
      ['ㄹ', 'ㅣ'],
      ' ',
      ['ㅎ', 'ㅗ'],
      ['ㄹ', 'ㅕ'],
      ' ',
      ['ᄒ', 'ᆞ'],
      ['ㄷ', 'ㅏ'],
      ',',
      ' ',
      '又',
      '欲',
      '也',
      ',',
      ' ',
      '待',
      '賣',
      '幾',
      '箇',
      '馬',
      '去',
      ' ',
      ['ㅇ', 'ㅕ'],
      ['ㄹ', 'ㅓ'],
      ' ',
      ['ᄆ', 'ᆞ'],
      ['ᄅ', 'ᆞ', 'ᆯ'],
      ' ',
      ['ᄑ', 'ᆞ', 'ᆯ'],
      ['ㅇ', 'ㅗ'],
      ['ㅈ', 'ㅕ'],
      ' ',
      ['ᄒ', 'ᆞ'],
      ['ㅇ', 'ㅑ'],
      ' ',
      ['ㄱ', 'ㅏ'],
      ['ㄴ', 'ㅗ'],
      ['ㄹ', 'ㅏ']
    ]
    expect(disassemble(input)).toEqual(output)
  })
})
