/* eslint-disable key-spacing, no-multi-spaces, standard/array-bracket-even-spacing */

// Reference
// https://ko.wikipedia.org/wiki/%EC%98%9B%ED%95%9C%EA%B8%80

export const ModernRange = {
  complete: [0xAC00, 0xD7AF],
  compatibilityJamo: [0x3130, 0x318f]
}

export const CompleteTable = {
  start: [
    'ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ',
    'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ',
    'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ',
    'ㅍ', 'ㅎ'
  ],
  middle: [
    'ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ',
    'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ',
    'ㅚ', 'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ',
    'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ'
  ],
  end: [
    '', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ', 'ㄹ',
    'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅁ',
    'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'
  ]
}

export const compatibilityTable = {
  0x3131: [0x1100, 0x11A8],  // 'ㄱ'
  0x3132: [0x1101, 0x11A9],  // 'ㄲ'
  0x3133: [        0x11AA],  // 'ㄳ'
  0x3134: [0x1102, 0x11AB],  // 'ㄴ'
  0x3135: [        0x11AC],  // 'ㄵ'
  0x3136: [        0x11AD],  // 'ㄶ'
  0x3137: [0x1103, 0x11AE],  // 'ㄷ'
  0x3138: [0x1104],          // 'ㄸ'
  0x3139: [0x1105, 0x11AF],  // 'ㄹ'
  0x313A: [        0x11B0],  // 'ㄺ'
  0x313B: [        0x11B1],  // 'ㄻ'
  0x313C: [        0x11B2],  // 'ㄼ'
  0x313D: [        0x11B3],  // 'ㄽ'
  0x313E: [        0x11B4],  // 'ㄾ'
  0x313F: [        0x11B5],  // 'ㄿ'
  0x3140: [        0x11B6],  // 'ㅀ'
  0x3141: [0x1106, 0x11B7],  // 'ㅁ'
  0x3142: [0x1107, 0x11B8],  // 'ㅂ'
  0x3143: [0x1108        ],  // 'ㅃ'
  0x3144: [        0x11B9],  // 'ㅄ'
  0x3145: [0x1109, 0x11BA],  // 'ㅅ'
  0x3146: [0x110A, 0x11BB],  // 'ㅆ'
  0x3147: [0x110B, 0x11BC],  // 'ㅇ'
  0x3148: [0x110C, 0x11BD],  // 'ㅈ'
  0x3149: [0x110D        ],  // 'ㅉ'
  0x314A: [0x110E, 0x11BE],  // 'ㅊ'
  0x314B: [0x110F, 0x11BF],  // 'ㅋ'
  0x314C: [0x1110, 0x11C0],  // 'ㅌ'
  0x314D: [0x1111, 0x11C1],  // 'ㅍ'
  0x314E: [0x1112, 0x11C2],  // 'ㅎ'
  0x314F: [0x1161],          // 'ㅏ'
  0x3150: [0x1162],          // 'ㅐ'
  0x3151: [0x1163],          // 'ㅑ'
  0x3152: [0x1164],          // 'ㅒ'
  0x3153: [0x1165],          // 'ㅓ'
  0x3154: [0x1166],          // 'ㅔ'
  0x3155: [0x1167],          // 'ㅕ'
  0x3156: [0x1168],          // 'ㅖ'
  0x3157: [0x1169],          // 'ㅗ'
  0x3158: [0x116A],          // 'ㅘ'
  0x3159: [0x116B],          // 'ㅙ'
  0x315A: [0x116C],          // 'ㅚ'
  0x315B: [0x116D],          // 'ㅛ'
  0x315C: [0x116E],          // 'ㅜ'
  0x315D: [0x116F],          // 'ㅝ'
  0x315E: [0x1170],          // 'ㅞ'
  0x315F: [0x1171],          // 'ㅟ'
  0x3160: [0x1172],          // 'ㅠ'
  0x3161: [0x1173],          // 'ㅡ'
  0x3162: [0x1174],          // 'ㅢ'
  0x3163: [0x1175]           // 'ㅣ'
}
